Create a table students with columns:

id (INT, primary key)

name (VARCHAR(50))

marks (INT)

class (VARCHAR(10))

Add a new column grade (VARCHAR(2)).

Rename column class â†’ section.

Delete the grade column.

Drop the students table completely.

In [1]:
%load_ext sql
%sql mysql+pymysql://root:root@localhost/first

In [2]:
%%sql 

CREATE TABLE students (id INT PRIMARY KEY, name VARCHAR(50),marks INT,
                       class varchar(10));

 * mysql+pymysql://root:***@localhost/first
(pymysql.err.OperationalError) (1050, "Table 'students' already exists")
[SQL: CREATE TABLE students (id INT PRIMARY KEY, name VARCHAR(50),marks INT,
                       class varchar(10));]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
desc students; 
ALTER TABLE students ADD grade VARCHAR(2);

In [ ]:
%%sql
ALTER TABLE students
RENAME COLUMN class TO section;

In [6]:
%%sql
CREATE TABLE faculty (name VARCHAR(20));
RENAME TABLE teachers to faculty;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
(pymysql.err.OperationalError) (1050, "Table 'faculty' already exists")
[SQL: RENAME TABLE teachers to faculty;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [9]:
%%sql
DROP TABLE faculty;
SHOW TABLES;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
3 rows affected.

[('employee',), ('employees',), ('students',)]

In [26]:

%%sql
INSERT INTO students (id, name, marks, section)
VALUES
(1, 'Aarav', 95, 'A'),
(2, 'Meera', 88, 'A'),
(3, 'Rohan', 76, 'B'),
(4, 'Priya', 64, 'B'),
(5, 'Karan', 82, 'C'),
(6, 'Isha', 91, 'C'),
(7, 'Vikram', 59, 'A'),
(8, 'Ananya', 85, 'B'),
(9, 'Sahil', 73, 'C'),
(10, 'Neha', 98, 'A');

 * mysql+pymysql://root:***@localhost/first
10 rows affected.

[]

Create a temporary table temp_high_marks that stores students with marks > 80.

Query the temporary table to show only name and marks.

Add a new student to the temporary table.

Drop the temporary table manually.

In [34]:
%%sql
CREATE TEMPORARY TABLE high_marks AS
SELECT name,section,marks
FROM students
WHERE marks>90;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[]

In [35]:
%%sql

SELECT * FROM  high_marks;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('Aarav', 'A', 95), ('Isha', 'C', 91), ('Neha', 'A', 98)]

In [37]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('employee',), ('employees',), ('students',)]

| Can you do operations before WITH? | No |
| Must it end with a query using it? | Yes |
| Can the last query be only SELECT? | No, it can also be INSERT, UPDATE, DELETE |

In [42]:
%%sql
WITH high_scores AS(
SELECT * FROM high_marks
WHERE marks>=75)
SELECT * FROM high_scores;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('Aarav', 'A', 95), ('Isha', 'C', 91), ('Neha', 'A', 98)]

In [44]:
%sql create database uber;

 * mysql+pymysql://root:***@localhost/first
1 rows affected.

[]

In [46]:
%%sql
CREATE TABLE uber.rides(
    ride_id INT,
    driver_id INT,
    rider_id INT,
    pickup_location VARCHAR(100),
    drop_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10,2));

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [47]:
%%sql

INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, drop_location, ride_date, fare)
VALUES
(1, 101, 201, 'Koramangala', 'Indiranagar', '2025-11-10 09:30:00', 250.50),
(2, 102, 202, 'MG Road', 'Whitefield', '2025-11-10 10:15:00', 540.75),
(3, 103, 203, 'BTM Layout', 'Electronic City', '2025-11-10 11:00:00', 420.00),
(4, 104, 204, 'HSR Layout', 'Marathahalli', '2025-11-10 12:45:00', 310.25),
(5, 105, 205, 'Bellandur', 'Koramangala', '2025-11-10 14:10:00', 180.00);

 * mysql+pymysql://root:***@localhost/first
5 rows affected.

[]

## Primary key:
Ensures each record is unique and not NULL.
Each table can have only one primary key.

In [50]:
%%sql
CREATE TABLE student (
    student_id INT PRIMARY KEY,
    name VARCHAR(50)
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## UNIQUE:
Ensures all values in a column are different (but allows one NULL).

In [53]:
%%sql
ALTER TABLE first.employees ADD COLUMN(
    email VARCHAR(100) UNIQUE
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [61]:
%%sql
ALTER TABLE uber.rides
ADD CONSTRAINT pk_driver UNIQUE (driver_id);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [63]:
%%sql
desc uber.rides; #not displayed as pk_driver for driver_id
SHOW INDEX FROM uber.rides; #To actually see the constraint name, use

 * mysql+pymysql://root:***@localhost/first
7 rows affected.
2 rows affected.

[('rides', 0, 'PRIMARY', 1, 'ride_id', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('rides', 0, 'pk_driver', 1, 'driver_id', 'A', 5, None, None, 'YES', 'BTREE', '', '', 'YES', None)]

## NOT NULL:
Ensures a column cannot have NULL values.

In [64]:
%%sql
CREATE TABLE users (
    username VARCHAR(50) NOT NULL
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## CHECK:
Ensures the values meet a specific condition.

In [66]:
%%sql
CREATE TABLE first.products (
    price DECIMAL(10,2) CHECK (price > 0)
);

 * mysql+pymysql://root:***@localhost/first
(pymysql.err.OperationalError) (1050, "Table 'products' already exists")
[SQL: CREATE TABLE first.products (
    price DECIMAL(10,2) CHECK (price > 0)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## DEFAULT:
Sets a default value when no value is given.

In [67]:
%%sql
CREATE TABLE accounts (
    balance DECIMAL(10,2) DEFAULT 0.00
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## AUTO_INCREMENT / SERIAL:
Automatically generates a unique value (mostly used for IDs).

In [68]:
%%sql
CREATE TABLE books (
    book_id INT AUTO_INCREMENT PRIMARY KEY,
    title VARCHAR(100)
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

## *COMPOSITE KEY*
Combines multiple columns as a single primary key.

In [69]:
%%sql
CREATE TABLE attendance (
    student_id INT,
    date DATE,
    PRIMARY KEY (student_id, date)
);

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]